posts/snailcheck/snailcheck.org
#+AUTHOR: Jeffrey Fisher
#+filetags: snailcheck ocaml

#+hugo_base_dir: ../../
#+hugo_custom_front_matter: :math true

* SnailCheck: Generating values by enumeration
:PROPERTIES:
:EXPORT_FILE_NAME: snailcheck-enum
:EXPORT_TITLE: SnailCheck: Enumerating types
:EXPORT_DATE: 2023-06-08
:header-args: :tangle 02/chapter-02.ml :noweb strip-export :results verbatim
:EXPORT_HUGO_DRAFT: true
:END:

** :noexport:
#+name: chp02-import
#+begin_src ocaml :tangle no
  #use "01/chapter-01.ml";;
  #use "02/chapter-02.ml";;
#+end_src

#+name: chp02-extra
#+begin_src ocaml :tangle no
  <<chp02-import>>
  #use "02/extra.ml";;
#+end_src

** 
[[file:/posts/snailcheck-lazy][Previous post in this series]].

In the previous post we saw the enumeration of the natural numbers. Now we will learn to enumerate more complex types.

** Enumerating booleans
Enumerating booleans is simpler than the naturals, but it's worth seeing. We'll make a convenience function for converting a regular list to a lazy list; it will also be useful for testing and for enumerating other types with few values.

#+begin_src ocaml
  let rec of_list xs =
    match xs with
    | [] -> Nil
    | x::xs -> Cons (x, fun () -> of_list xs)
#+end_src

#+begin_src ocaml
  let bool : bool lazylist = of_list [true; false]
#+end_src

#+begin_src ocaml :tangle no :exports both
  <<chp02-import>>
  take 2 bool
#+end_src

#+RESULTS:
: - : bool list = [true; false]

Note: We are doing some punning here to allow conciseness. [fn:pun] When used in types "bool" will still refer to the the standard boolean type. But when used in expressions "bool" means this particular lazy list.

[fn:pun] We're also doing punning because [[https://c-cube.github.io/qcheck/][QCheck]] does it that way, and we want to be compatible with QCheck.

** Enumerating integers
*** Problem
Listing the integers is non-obvious because unlike the naturals there is no "starting point". In math you can discuss the range \((-\infty, \infty)\), but in code we can't start at negative infinity.

OCaml's =int= type does technically have a starting point, =min_int=, which seems to be \(-2^{62}\). Maybe we could do =let int = up_from min_int=? There are a few problems with this:

1. For a while all you'll be seeing is negative numbers with a large magnitude. It's easier to work with smaller numbers, and we also want to check zero and positive numbers. One of the benefits of enumerative property-based testing is trying the simplest cases first---with random generation you tend to get huge test values that need to be "shrinked".
2. "a while" is probably longer than a human lifespan. Rough calculations with a 5 millisecond time per check gave me an 11-digit number of /years/. 5 ms is perhaps a long time for executing a function, but even at the nanosecond scale you can't exhaust the integers. A quick Internet search says even just incrementing a counter from 0 to 2^{64} (not even checking properties) would take around 100 years.
3. Sometimes we may want to use a special integer type that can represent arbitrarily-large integers. Then there will be no such thing as =min_int=.

*** Solution
There is a way to arrange the integers that gives them a starting point and gives the simplest cases first: \(0, -1, 1, -2, 2, -3, 3, \ldots\) [fn:well-ordering]

We could express this as a single generator function like we did with the naturals:

#+begin_src ocaml :tangle no :exports both
  <<chp02-import>>
  let int : int lazylist =
    let rec ints' n =
      Cons (-n, fun () ->
               Cons (n, fun () -> ints' (n + 1))) in
    Cons (0, fun () -> ints' 1)
  ;;

  take 9 int
#+end_src

#+RESULTS:
: - : int list = [0; -1; 1; -2; 2; -3; 3; -4; 4]

However, we will express it in a way that I feel is more elegant. It will be useful to examine this technique with the integers first, because we will need it for more complex types later.

\[\mathbb{Z} = \mathbb{N} \cup \{-1, -2, -3, \ldots\}\]

We can break the integers into pieces. If we combine the natural numbers and the negative integers, we get the set of all integers.

The common way to combine lists is appending.

#+begin_src ocaml :tangle 02/extra.ml
  let rec append xs ys =
    match xs, ys with
    | Nil, ys -> ys
    | Cons (x, xs), ys ->
       Cons (x, fun () -> append (force xs) ys)
#+end_src

Let's confirm that our lazy list =append= works:

#+begin_src ocaml :tangle no :exports both
  <<chp02-extra>>
  take 6 @@ append (of_list [1;2;3]) (of_list [4;5;6])
#+end_src

#+RESULTS:
: - : int list = [1; 2; 3; 4; 5; 6]

Now let's try making the integers:

#+begin_src ocaml
  let rec down_from n = Cons (n, fun () -> down_from (n - 1))
#+end_src

#+begin_src ocaml :tangle no :exports both
  <<chp02-extra>>
  let int = append nats (down_from (-1)) in
  take 9 int
#+end_src

#+RESULTS:
: - : int list = [0; 1; 2; 3; 4; 5; 6; 7; 8]

Oh no, we aren't seeing any negatives! There are infinitely many naturals, so we'll never get to the negatives.

If we make a slight change to our =append= function, we can get the behavior we want.

#+begin_src ocaml
  let rec interleave xs ys =
    match xs, ys with
    | Nil, ys -> ys
    | Cons (x, xs), ys ->
       Cons (x, fun () -> interleave ys (force xs))
           (* Difference: append (force xs) ys *)

  (* Operator form. *)
  let ( @| ) = interleave

  let int : int lazylist = nats @| (down_from (-1))
#+end_src

In the recursive call we now swap the position of =xs= and =ys=, so we will get the behavior of alternating which list we grab from.

#+begin_src ocaml :tangle no :exports both
  <<chp02-extra>>
  take 9 int
#+end_src

#+RESULTS:
: - : int list = [0; -1; 1; -2; 2; -3; 3; -4; 4]

[fn:well-ordering] Apparently this is called the [[https://en.wikipedia.org/wiki/Well-order#Integers][well-ordering of the integers]]. I'd seen this ordering before, and I recently learned the Well-Ordering Principle, but hadn't made the connection until looking it up just now.

** Enumerating tuples
Not all functions deal with simple scalar types. We also want to enumerate structured types, starting with tuples.

First let's add the ability to map over lazy lists.

#+begin_src ocaml
  let rec map f xs =
    match xs with
    | Nil -> Nil
    | Cons (x, xs) ->
       Cons (f x,
             fun () -> map f (force xs))
#+end_src

#+begin_src ocaml :tangle no :exports both
  <<chp02-import>>
  let square x = x * x in
  let perfect_squares = map square nats in
  take 10 perfect_squares
#+end_src

#+RESULTS:
: - : int list = [0; 1; 4; 9; 16; 25; 36; 49; 64; 81]

#+begin_src ocaml
  let rec pair_with x ll =
    map (fun y -> (x, y)) ll

  let rec pair xlist ylist =
    match xlist, ylist with
    | Cons (x, xrest), Cons (y, yrest) ->
       (* x paired with every y, interleaved with: pair xs ylist *)
       Cons ((x,y),
             fun () -> pair_with x (force yrest) @| pair (force xrest) ylist)
    | Nil, _ -> Nil
    | _, Nil -> Nil
#+end_src

The key idea is to pair up the first =x= with every =y= in =ylist=, then combine that with the pairing of =xrest= with =ylist=.

Note that =pair_with x (force yrest)= actually uses =yrest=, so it skips the first =y=. This is fine though because we have the pairing of =x= and the first =y= with =Cons ((x,y), ...)=.

The =Cons ((x,y), ...)= piece is a bit inelegant, but necessary with the current implementation of =interleave=. Later we will solve this issue and clean up =pair=.

#+begin_src ocaml :tangle no :exports both
  <<chp02-import>>
  take 10 @@ pair_with 42 (of_list [1;2;3;4;5])
#+end_src

#+RESULTS:
: - : (int * int) list = [(42, 1); (42, 2); (42, 3); (42, 4); (42, 5)]

#+begin_src ocaml :tangle no :exports both
  <<chp02-extra>>
  take 10 @@ pair bool bool
#+end_src

#+RESULTS:
: - : (bool * bool) list =
: [(true, true); (true, false); (false, true); (false, false)]

#+begin_src ocaml :tangle no :exports both
  <<chp02-extra>>
  take 10 @@ pair int int
#+end_src

#+RESULTS:
: - : (int * int) list =
: [(0, 0); (0, -1); (-1, 0); (0, 1); (-1, -1); (0, -2); (1, 0); (0, 2);
:  (-1, 1); (0, -3)]

We can of course mix different types.

#+begin_src ocaml :tangle no :exports both
  <<chp02-extra>>
  take 10 @@ pair int bool
#+end_src

#+RESULTS:
: - : (int * bool) list =
: [(0, true); (0, false); (-1, true); (-1, false); (1, true); (1, false);
:  (-2, true); (-2, false); (2, true); (2, false)]

