posts/snailcheck/snailcheck.org
*** Triples and n-tuples
Two is a magic number. We can mimic n-tuples using nested pairs.

For example: =(1, (2, 3))=.

#+begin_src ocaml
  let triple xs ys zs =
    let triple_of_nest (a, (b, c)) = (a, b, c) in
    map triple_of_nest (pair xs (pair ys zs))
#+end_src

#+begin_src ocaml :tangle no :exports both
  <<chp02-import>>
  take 5 @@ triple int (pair bool int) int
#+end_src

#+RESULTS:
: - : (int * (bool * int) * int) list =
: [(0, (true, 0), 0); (0, (true, 0), -1); (-1, (true, 0), 0);
:  (0, (true, -1), 0); (-1, (true, 0), -1)]

** Enumerating algebraic data types (ADT)
Here's an interesting but still simple ADT: a binary tree.

#+begin_src ocaml :tangle 02/extra.ml
  type 'a tree = Leaf | Branch of 'a * 'a tree * 'a tree
#+end_src

The enumeration of ADT constructors can be built directly off of tuple enumeration. We enumerate n-tuples, where n is the number of arguments to the constructor, then construct values.

#+begin_src ocaml
  let cons0 cons = of_list [cons]
  let cons1 cons a = map cons a
  let cons2 cons a b = map cons (pair a b)
  let cons3 cons a b c = map cons (triple a b c)
#+end_src

In OCaml constructors cannot be passed around like functions, so we will define function wrappers to pass to =consN=.

#+begin_src ocaml :tangle 02/extra.ml
  let leaf = Leaf;;
  let branch (v, l, r) = Branch (v, l, r)
#+end_src

The =branch= function converts an appropriate tuple into a tree branch.

#+begin_src ocaml :tangle 02/extra.ml
  let rec tree_a typ =
    cons0 leaf
    @| cons3 branch typ (tree_a typ) (tree_a typ)
#+end_src

The type =tree= has two constructors. We start with the simple one, =Leaf=. It is a nullary constructor (no arguments), so we do =cons0 leaf= to enumerate it.

The other constructor is =Branch=, which has 3 parts, so we use =cons3=. The first part is of type ='a=, the type the tree is parameterized by. We have the =typ= argument to take in the enumeration of ='a=, so we do =cons3 branch typ=. The next two parts are both of type tree, so we have =cons3 branch typ (tree_a typ) (tree_a typ)=.

Writing enumerations of algebraic data types is a simple, mechanical process.[fn:mechanical]

Let's check out the result.

#+begin_src ocaml :tangle no :exports both
  <<chp02-extra>>
  take 5 @@ (tree_a int)
#+end_src

#+RESULTS:
: Stack overflow during evaluation (looping recursion?).

Turns out I lied a bit. What went wrong?

The top level function in the body of =tree_a= is =@|= (a.k.a. =interleave=). OCaml uses [[https://en.wikipedia.org/wiki/Strict_programming_language][strict evaluation]], so we evaluate the arguments before evaluating the function. The left argument =cons0 leaf= is fine. The problem arises in the right argument, which has recursive calls to =tree_a=.

With recursion it is usually important to have:

1. A base case.
2. Recursive calls make the input "smaller", approaching the base case.
3. Conditional that checks whether to perform the base or recursive case.

We have a base case of =cons0 leaf=, but we don't have a conditional. Conditionals are special in that only some of their arguments/branches are evaluated each time, while functions have *all* of their arguments evaluated every time.

The problem is that we are always evaluating the recursive calls in =cons3 branch typ (tree_a typ) (tree_a typ)=, so we recurse infinitely.

[fn:mechanical] That means we can automate the generation of enumerations of algebraic data types! I may write a post about this in the future.

*** Solution
Imagine you are =tree_a=. This is roughly the behavior we want:

- For the first tree, I'll give you a =Leaf=.
- For the second tree, I'll give you a =Branch=.
  - To make a branch, I need to make a ='a=. That's easy, I use =typ=.
  - I also need to make two of ='a tree=. To do that, I make two nested calls of =tree_a typ=.
    - I'm the first nested call. I'll give you the first tree in the enumeration. That's =Leaf=.
    - I'm the second nested call. I'll give you the first tree in the enumeration. That's =Leaf=.
  - I've completed giving =Branch Leaf Leaf=.
- For the third tree, ...

If we grab the base case (=Leaf=) first, we can manage to build recursive cases (=Branch=).

We can't do this with strict evaluation, so we need to add a bit of laziness. We will write =lazy_interleave= so that its arguments are both lazy (=delayed=), so we won't get stuck on recursive calls encountered while evaluating the arguments to =lazy_interleave=.[fn:lazy-interleave]

#+begin_src ocaml
  let rec lazy_interleave (xs : 'a lazylist delayed) (ys: 'a lazylist delayed) =
    let xs = force xs in
    match xs with
    | Nil -> force ys
    | Cons (x, xs) ->
       Cons (x, fun () -> lazy_interleave ys xs)

  let ( @|| ) = lazy_interleave
#+end_src

Now we can enumerate trees.

#+begin_src ocaml :tangle no :exports both
  <<chp02-extra>>
  let rec tree typ =
    let a = fun () -> cons0 leaf in
    let b = fun () -> cons3 branch typ (tree typ) (tree typ) in
    a @|| b
  in

  take 3 @@ tree int
#+end_src

#+RESULTS:
: - : int tree list =
: [Leaf; Branch (0, Leaf, Leaf); Branch (0, Leaf, Branch (0, Leaf, Leaf))]

[fn:lazy-interleave]
There's not much use in keeping the non-lazy version of =interleave= around; I consider it broken. I only gave =lazy_interleave= a new name as a shortcut to appease the literate programming setup I'm using.

*** Order matters
Remember when I said we needed to grab the base case(s) before the recursive case(s)? With the current code, that's true.

#+begin_src ocaml :tangle no :exports both
  <<chp02-extra>>
  let rec tree_bad typ =
    let a = fun () -> cons3 branch typ (tree_bad typ) (tree_bad typ) in
    let b = fun () -> cons0 leaf in
    a @|| b
  in
  take 5 @@ tree_bad int
#+end_src

#+RESULTS:
: Stack overflow during evaluation (looping recursion?).

This is problematic. It's annoying to remember and results in an unhelpful error message.[fn:order-error]

It's not simply a matter of laziness. [[http://jmct.cc/pearlcheck.pdf][PearlCheck]], which is written in the lazy language Haskell, also faces this problem---though it is solved later in the paper.[fn:pearlcheck-order]

It is possible to solve this problem in SnailCheck if we switch from simple enumerated lists to =tiers=, like PearlCheck uses. That may be covered in a later post, but for now you can check out the PearlCheck paper.

[fn:order-error]
If you know of a way to detect the problem and provide a helpful error message, let me know!

Maybe stack overflow is a catchable exception, and could print an error message that suggests that the problem could be the order of the ADT cases. However, I say "suggest" because there could be other reasons for stack overflow; this merely detects a symptom rather than the problem.

I'm thinking proper detection would require some sort of static analysis. Maybe it could be done with a [[https://ocaml.org/docs/metaprogramming][PPX]].

[fn:pearlcheck-order]
PearlCheck doesn't mention this problem, but if you copy the code up through "Mark II: Algebraic Datatypes" you can reproduce the problem on this example:

#+begin_src haskell :tangle no
  instance Listable Expr where
    -- Different from the one in the paper.
    -- Recursive case comes first / on the left.
    list = cons2 Add \/ cons1 Val

  -- Gets stuck here on infinite recursion.
  take 5 (list :: [Expr])
#+end_src

The error goes away at "Mark IV: Fair Enumeration" because of the swap from =list= to =tiers=.

** Enumerating lists
Lists in OCaml are essentially an algebraic data type, so we can enumerate them now.

#+begin_src ocaml
  let rec list typ =
    let cons (x, xs) = x :: xs in
    (fun () -> cons0 [])
    @|| (fun () -> cons2 cons typ (list typ))
#+end_src

#+begin_src ocaml :tangle no :exports both
  <<chp02-import>>
  take 5 @@ list bool
#+end_src

#+RESULTS:
: - : bool list list = [[]; [true]; [true; true]; [false]; [true; true; true]]

** Elegant =pair=
As promised, here is the elegant version of =pair=. This eliminates the =Cons ((x,y), ...)= and expresses it only with =pair_with= and a recursive call.

#+begin_src ocaml :tangle 02/extra.ml
  let rec elegant_pair xlist ylist =
    match xlist, ylist with
    | Cons (x, xrest), Cons (y, yrest) ->
       (* x paired with every y, then repeat with xrest. *)
       (fun () -> pair_with x ylist)
       @|| (fun () -> elegant_pair (force xrest) ylist)
    | Nil, _ -> Nil
    | _, Nil -> Nil
#+end_src

#+begin_src ocaml :tangle no :exports both
  <<chp02-extra>>
  take 10 @@ elegant_pair int int
#+end_src

#+RESULTS:
: - : (int * int) list =
: [(0, 0); (-1, 0); (0, -1); (1, 0); (0, 1); (-1, -1); (0, -2); (-2, 0);
:  (0, 2); (-1, 1)]

#+begin_src ocaml :tangle no :exports both
  <<chp02-extra>>
  take 10 @@ pair int int
#+end_src

#+RESULTS:
: - : (int * int) list =
: [(0, 0); (0, -1); (-1, 0); (0, 1); (-1, -1); (0, -2); (1, 0); (0, 2);
:  (-1, 1); (0, -3)]

The order is a bit different, but it's still correct.

