content/posts/snailcheck-enum.md


### Triples and n-tuples {#triples-and-n-tuples}

Two is a magic number. We can mimic n-tuples using nested pairs.

For example: `(1, (2, 3))`.

```ocaml
let triple xs ys zs =
  let triple_of_nest (a, (b, c)) = (a, b, c) in
  map triple_of_nest (pair xs (pair ys zs))
```

```ocaml

take 5 @@ triple int (pair bool int) int
```

```text
- : (int * (bool * int) * int) list =
[(0, (true, 0), 0); (0, (true, 0), -1); (-1, (true, 0), 0);
 (0, (true, -1), 0); (-1, (true, 0), -1)]
```


## Enumerating algebraic data types (ADT) {#enumerating-algebraic-data-types--adt}

Here's an interesting but still simple ADT: a binary tree.

```ocaml
type 'a tree = Leaf | Branch of 'a * 'a tree * 'a tree
```

The enumeration of ADT constructors can be built directly off of tuple enumeration. We enumerate n-tuples, where n is the number of arguments to the constructor, then construct values.

```ocaml
let cons0 cons = of_list [cons]
let cons1 cons a = map cons a
let cons2 cons a b = map cons (pair a b)
let cons3 cons a b c = map cons (triple a b c)
```

In OCaml constructors cannot be passed around like functions, so we will define function wrappers to pass to `consN`.

```ocaml
let leaf = Leaf;;
let branch (v, l, r) = Branch (v, l, r)
```

The `branch` function converts an appropriate tuple into a tree branch.

```ocaml
let rec tree_a typ =
  cons0 leaf
  @| cons3 branch typ (tree_a typ) (tree_a typ)
```

The type `tree` has two constructors. We start with the simple one, `Leaf`. It is a nullary constructor (no arguments), so we do `cons0 leaf` to enumerate it.

The other constructor is `Branch`, which has 3 parts, so we use `cons3`. The first part is of type `'a`, the type the tree is parameterized by. We have the `typ` argument to take in the enumeration of `'a`, so we do `cons3 branch typ`. The next two parts are both of type tree, so we have `cons3 branch typ (tree_a typ) (tree_a typ)`.

Writing enumerations of algebraic data types is a simple, mechanical process.[^fn:3]

Let's check out the result.

```ocaml

take 5 @@ (tree_a int)
```

```text
Stack overflow during evaluation (looping recursion?).
```

Turns out I lied a bit. What went wrong?

The top level function in the body of `tree_a` is `@|` (a.k.a. `interleave`). OCaml uses [strict evaluation](https://en.wikipedia.org/wiki/Strict_programming_language), so we evaluate the arguments before evaluating the function. The left argument `cons0 leaf` is fine. The problem arises in the right argument, which has recursive calls to `tree_a`.

With recursion it is usually important to have:

1.  A base case.
2.  Recursive calls make the input "smaller", approaching the base case.
3.  Conditional that checks whether to perform the base or recursive case.

We have a base case of `cons0 leaf`, but we don't have a conditional. Conditionals are special in that only some of their arguments/branches are evaluated each time, while functions have **all** of their arguments evaluated every time.

The problem is that we are always evaluating the recursive calls in `cons3 branch typ (tree_a typ) (tree_a typ)`, so we recurse infinitely.


### Solution {#solution}

Imagine you are `tree_a`. This is roughly the behavior we want:

-   For the first tree, I'll give you a `Leaf`.
-   For the second tree, I'll give you a `Branch`.
    -   To make a branch, I need to make a `'a`. That's easy, I use `typ`.
    -   I also need to make two of `'a tree`. To do that, I make two nested calls of `tree_a typ`.
        -   I'm the first nested call. I'll give you the first tree in the enumeration. That's `Leaf`.
        -   I'm the second nested call. I'll give you the first tree in the enumeration. That's `Leaf`.
    -   I've completed giving `Branch Leaf Leaf`.
-   For the third tree, ...

If we grab the base case (`Leaf`) first, we can manage to build recursive cases (`Branch`).

We can't do this with strict evaluation, so we need to add a bit of laziness. We will write `lazy_interleave` so that its arguments are both lazy (`delayed`), so we won't get stuck on recursive calls encountered while evaluating the arguments to `lazy_interleave`.[^fn:4]

```ocaml
let rec lazy_interleave (xs : 'a lazylist delayed) (ys: 'a lazylist delayed) =
  let xs = force xs in
  match xs with
  | Nil -> force ys
  | Cons (x, xs) ->
     Cons (x, fun () -> lazy_interleave ys xs)

let ( @|| ) = lazy_interleave
```

Now we can enumerate trees.

```ocaml

let rec tree typ =
  let a = fun () -> cons0 leaf in
  let b = fun () -> cons3 branch typ (tree typ) (tree typ) in
  a @|| b
in

take 3 @@ tree int
```

```text
- : int tree list =
[Leaf; Branch (0, Leaf, Leaf); Branch (0, Leaf, Branch (0, Leaf, Leaf))]
```


### Order matters {#order-matters}

Remember when I said we needed to grab the base case(s) before the recursive case(s)? With the current code, that's true.

```ocaml

let rec tree_bad typ =
  let a = fun () -> cons3 branch typ (tree_bad typ) (tree_bad typ) in
  let b = fun () -> cons0 leaf in
  a @|| b
in
take 5 @@ tree_bad int
```

```text
Stack overflow during evaluation (looping recursion?).
```

This is problematic. It's annoying to remember and results in an unhelpful error message.[^fn:5]

It's not simply a matter of laziness. [PearlCheck](http://jmct.cc/pearlcheck.pdf), which is written in the lazy language Haskell, also faces this problem---though it is solved later in the paper.[^fn:6]

It is possible to solve this problem in SnailCheck if we switch from simple enumerated lists to `tiers`, like PearlCheck uses. That may be covered in a later post, but for now you can check out the PearlCheck paper.


## Enumerating lists {#enumerating-lists}

Lists in OCaml are essentially an algebraic data type, so we can enumerate them now.

```ocaml
let rec list typ =
  let cons (x, xs) = x :: xs in
  (fun () -> cons0 [])
  @|| (fun () -> cons2 cons typ (list typ))
```

```ocaml

take 5 @@ list bool
```

```text
- : bool list list = [[]; [true]; [true; true]; [false]; [true; true; true]]
```


## Elegant `pair` {#elegant-pair}

As promised, here is the elegant version of `pair`. This eliminates the `Cons ((x,y), ...)` and expresses it only with `pair_with` and a recursive call.

```ocaml
let rec elegant_pair xlist ylist =
  match xlist, ylist with
  | Cons (x, xrest), Cons (y, yrest) ->
     (* x paired with every y, then repeat with xrest. *)
     (fun () -> pair_with x ylist)
     @|| (fun () -> elegant_pair (force xrest) ylist)
  | Nil, _ -> Nil
  | _, Nil -> Nil
```

```ocaml

take 10 @@ elegant_pair int int
```

```text
- : (int * int) list =
[(0, 0); (-1, 0); (0, -1); (1, 0); (0, 1); (-1, -1); (0, -2); (-2, 0);
 (0, 2); (-1, 1)]
```

```ocaml

take 10 @@ pair int int
```

```text
- : (int * int) list =
[(0, 0); (0, -1); (-1, 0); (0, 1); (-1, -1); (0, -2); (1, 0); (0, 2);
 (-1, 1); (0, -3)]
```

The order is a bit different, but it's still correct.
